//2021年4月17日14点42分 
# include <stdio.h>
# define N 11
int main() 
{
	int i,j,y[N][N];//0行，０列不用 
	for(i=1;i<N;++i)
	{
		y[i][1]=y[i][i]=1;// 第1列与对角线元素均为1 
		for(j=2;j<=i-1;++j)//每一行从第2个元素开始 
		y[i][j]=y[i-1][j]+y[i-1][j-1];//计算每个元素的值 
	}
	for(i=1;i<N;++i)
	{
	for(j=1;j<=i;++j)//每一行只要计算到对角线元素即可 
	printf("%4d",y[i][j]);//利用%4d的格式控制输出的数据对齐 
	printf("\n");//换行 
	}
	
	return 0;
}
/*
---------------------------------- 
运行结果为： 
   1
   1   1
   1   2   1
   1   3   3   1
   1   4   6   4   1
   1   5  10  10   5   1
   1   6  15  20  15   6   1
   1   7  21  35  35  21   7   1
   1   8  28  56  70  56  28   8   1
   1   9  36  84 126 126  84  36   9   1
------------------------------------ 
*/ 
